[
  {
    "title": "Amazons's Basics 3-Button USB wired mouse, works good, looks good, reduces the EMF",
    "rating": "rating",
    "text": "This Amazon Basics 3-Button USB wired mouse is easy to review. It was delivered in a solid, well protected box. installing it was easy. It fit well, functions well, is responsive, and the design reminds me of when computer mouses were first introduced, so the familiarity is refreshing. It tracks well, without too fast or slow a speed and doesn't need batteries. I bought it because it is wired and helps reduce the EMF around the computer from 20 mG with a wireless mouse to 0 mG for this one.",
    "reviewer_name": "Coopra102",
    "date": "Reviewed in the United States on May 16, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "2 people found this helpful",
    "title_cleaned": "amazons's basics 3-button usb wired mouse, works good, looks good, reduces the emf",
    "text_cleaned": "this amazon basics 3-button usb wired mouse is easy to review. it was delivered in a solid, well protected box. installing it was easy. it fit well, functions well, is responsive, and the design reminds me of when computer mouses were first introduced, so the familiarity is refreshing. it tracks well, without too fast or slow a speed and doesn't need batteries. i bought it because it is wired and helps reduce the emf around the computer from 20 mg with a wireless mouse to 0 mg for this one.",
    "date_cleaned": "2025-05-16",
    "verified_purchase_bool": true,
    "helpful_votes_count": 2,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.6898567080497742
  },
  {
    "title": "Quick and easy",
    "rating": "rating",
    "text": "This is simply wonderful. All of a sudden one day, I was unable to scroll with my mouse. What a pain! I'd had that one for 2 years maybe. I'd say I got my money's worth. I ordered the same one and it was here in one or two days, couldn't get any simpler.",
    "reviewer_name": "zentrainer",
    "date": "Reviewed in the United States on May 28, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "quick and easy",
    "text_cleaned": "this is simply wonderful. all of a sudden one day, i was unable to scroll with my mouse. what a pain! i'd had that one for 2 years maybe. i'd say i got my money's worth. i ordered the same one and it was here in one or two days, couldn't get any simpler.",
    "date_cleaned": "2025-05-28",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7731887698173523
  },
  {
    "title": "Perfect Old School Mouse",
    "rating": "rating",
    "text": "Honestly, I'm too old school to use a wireless mouse. I want something super simple that I can just plug in and go, and that's exactly what this is. Easy to use, long enough wire, and quality from Amazon Basics.",
    "reviewer_name": "Kevin R",
    "date": "Reviewed in the United States on June 3, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "perfect old school mouse",
    "text_cleaned": "honestly, i'm too old school to use a wireless mouse. i want something super simple that i can just plug in and go, and that's exactly what this is. easy to use, long enough wire, and quality from amazon basics.",
    "date_cleaned": "2025-06-03",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5974897146224976
  },
  {
    "title": "no-nonsense mouse without spending a lot",
    "rating": "rating",
    "text": "Overview: The Amazon Basics Responsive and Precise 3-Button Wired USB Computer Mouse is a simple yet effective peripheral for everyday use. Whether you're browsing, working, or gaming casually, this mouse delivers reliability and comfort without breaking the bank. It’s a no-frills, budget-friendly option for those who just need a solid, functional mouse.\n\nBuild & Design (4/5): The mouse has a minimalist design, featuring a matte black finish that’s smooth to the touch and resistant to fingerprints. It fits comfortably in most hands, though those with larger hands may find it a bit snug. The three main buttons (left, right, and scroll) are responsive and have a satisfying click, and the scroll wheel is accurate and not too stiff. The overall build quality feels sturdy, and the cable is a decent length (around 5 feet), offering ample movement range without tangling.\n\nPerformance (5/5): This is where the mouse shines. The optical sensor is responsive, offering accurate tracking for everyday tasks. Whether you’re working on documents, browsing the web, or playing a light game, the mouse performs smoothly on various surfaces. There's no noticeable lag or erratic movement, and the cursor moves precisely where you expect. The DPI (dots per inch) isn't adjustable, but for most users, the default setting provides a good balance between speed and accuracy.\n\nInstallation (5/5): Setup is straightforward. Simply plug the USB cable into your computer, and the mouse is ready to use in seconds—no drivers or software installation required. It's compatible with both Windows and macOS, which is a big plus for those using multiple devices.\n\nDurability (4/5): While the mouse is well-built for its price point, the plastic shell may not hold up as well as higher-end mice, especially with heavy use over time. The cable is flexible and should stand up to typical wear, but it could fray with constant bending. However, for the average user, this should last quite a while with proper care.\n\nValue for Money (5/5): At such a low price, this mouse offers exceptional value for money. It does exactly what it’s supposed to do without any frills or unnecessary features. If you're looking for a reliable, no-nonsense mouse without spending a lot, this is an excellent option.\n\nFinal Thoughts: The Amazon Basics 3-Button Wired Mouse is an outstanding budget pick. It provides solid performance, comfortable ergonomics, and a simple, reliable design. While it’s not packed with advanced features like adjustable DPI or extra buttons for gaming, it’s an excellent choice for everyday computing. Ideal for home offices, students, and casual users alike, this mouse represents great value for money.",
    "reviewer_name": "Lissa R",
    "date": "Reviewed in the United States on January 15, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "3 people found this helpful",
    "title_cleaned": "no-nonsense mouse without spending a lot",
    "text_cleaned": "overview: the amazon basics responsive and precise 3-button wired usb computer mouse is a simple yet effective peripheral for everyday use. whether you're browsing, working, or gaming casually, this mouse delivers reliability and comfort without breaking the bank. it’s a no-frills, budget-friendly option for those who just need a solid, functional mouse.\n\nbuild & design (4/5): the mouse has a minimalist design, featuring a matte black finish that’s smooth to the touch and resistant to fingerprints. it fits comfortably in most hands, though those with larger hands may find it a bit snug. the three main buttons (left, right, and scroll) are responsive and have a satisfying click, and the scroll wheel is accurate and not too stiff. the overall build quality feels sturdy, and the cable is a decent length (around 5 feet), offering ample movement range without tangling.\n\nperformance (5/5): this is where the mouse shines. the optical sensor is responsive, offering accurate tracking for everyday tasks. whether you’re working on documents, browsing the web, or playing a light game, the mouse performs smoothly on various surfaces. there's no noticeable lag or erratic movement, and the cursor moves precisely where you expect. the dpi (dots per inch) isn't adjustable, but for most users, the default setting provides a good balance between speed and accuracy.\n\ninstallation (5/5): setup is straightforward. simply plug the usb cable into your computer, and the mouse is ready to use in seconds—no drivers or software installation required. it's compatible with both windows and macos, which is a big plus for those using multiple devices.\n\ndurability (4/5): while the mouse is well-built for its price point, the plastic shell may not hold up as well as higher-end mice, especially with heavy use over time. the cable is flexible and should stand up to typical wear, but it could fray with constant bending. however, for the average user, this should last quite a while with proper care.\n\nvalue for money (5/5): at such a low price, this mouse offers exceptional value for money. it does exactly what it’s supposed to do without any frills or unnecessary features. if you're looking for a reliable, no-nonsense mouse without spending a lot, this is an excellent option.\n\nfinal thoughts: the amazon basics 3-button wired mouse is an outstanding budget pick. it provides solid performance, comfortable ergonomics, and a simple, reliable design. while it’s not packed with advanced features like adjustable dpi or extra buttons for gaming, it’s an excellent choice for everyday computing. ideal for home offices, students, and casual users alike, this mouse represents great value for money.",
    "date_cleaned": "2025-01-15",
    "verified_purchase_bool": true,
    "helpful_votes_count": 3,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.7836064100265503
  },
  {
    "title": "Cheaper Is Sometimes Better",
    "rating": "rating",
    "text": "Basic mouse for a nice laptop. I had spent a bunch if money on a brand new laptop last year and didn't want to spend a bunch more on a mouse and so I got this little guy who does it's job quite well for its cheap prize. Goes to show sometimes the more expensive item isn't the best item.",
    "reviewer_name": "Makayla Kitt",
    "date": "Reviewed in the United States on May 18, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "cheaper is sometimes better",
    "text_cleaned": "basic mouse for a nice laptop. i had spent a bunch if money on a brand new laptop last year and didn't want to spend a bunch more on a mouse and so i got this little guy who does it's job quite well for its cheap prize. goes to show sometimes the more expensive item isn't the best item.",
    "date_cleaned": "2025-05-18",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.6252993941307068
  },
  {
    "title": "⭐⭐⭐⭐⭐ It's a Mouse. It Clicks. It Scrolls. It’s Glorious.",
    "rating": "rating",
    "text": "This mouse is the unsung hero of my desk. It doesn’t light up like a disco ball. It doesn’t have 47 customizable buttons or whisper sweet nothings to my hand. It’s just a mouse. A solid, dependable, clicky little legend.\n\nPlugged it in—BOOM—instantly worked like it had been waiting its whole life for this moment. No software, no drama, no weird driver updates from 2003. Just pure, old-school plug-and-play magic. Like the mouse equivalent of a dad who shows up early, wears cargo shorts, and gets the job done.\n\nScrolling? Smooth as butter on a warm pancake. Clicking? So responsive it almost feels judgy. I accidentally clicked on three emails I was trying to avoid and suddenly felt like I owed the mouse an apology.\n\nIt’s not flashy, but it does what it’s supposed to do without asking for attention. Like a quiet coworker who knows Excel better than anyone but just wants to be left alone.\n\nSo if you want a mouse that’s not trying to be a Transformer or your new best friend—this is it. Reliable, precise, no frills… just vibes and functionality.\n\n10/10. Would click again.\n\nWant a sarcastic version or a dramatic love letter to the scroll wheel? I’ve got you.",
    "reviewer_name": "jaurb",
    "date": "Reviewed in the United States on March 19, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "6 people found this helpful",
    "title_cleaned": "⭐⭐⭐⭐⭐ it's a mouse. it clicks. it scrolls. it’s glorious.",
    "text_cleaned": "this mouse is the unsung hero of my desk. it doesn’t light up like a disco ball. it doesn’t have 47 customizable buttons or whisper sweet nothings to my hand. it’s just a mouse. a solid, dependable, clicky little legend.\n\nplugged it in—boom—instantly worked like it had been waiting its whole life for this moment. no software, no drama, no weird driver updates from 2003. just pure, old-school plug-and-play magic. like the mouse equivalent of a dad who shows up early, wears cargo shorts, and gets the job done.\n\nscrolling? smooth as butter on a warm pancake. clicking? so responsive it almost feels judgy. i accidentally clicked on three emails i was trying to avoid and suddenly felt like i owed the mouse an apology.\n\nit’s not flashy, but it does what it’s supposed to do without asking for attention. like a quiet coworker who knows excel better than anyone but just wants to be left alone.\n\nso if you want a mouse that’s not trying to be a transformer or your new best friend—this is it. reliable, precise, no frills… just vibes and functionality.\n\n10/10. would click again.\n\nwant a sarcastic version or a dramatic love letter to the scroll wheel? i’ve got you.",
    "date_cleaned": "2025-03-19",
    "verified_purchase_bool": true,
    "helpful_votes_count": 6,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5865558385848999
  },
  {
    "title": "Nice and Simple",
    "rating": "rating",
    "text": "We purchased this mouse for the great price and lack of unnecessary buttons. My mom was always hitting the extra side buttons on other mice I bought her frustrating herself in the process. This follows the KISS principle, keep it simple! I would recommend this to anyone dealing with arthritis needing a simple mouse that is easy to use.",
    "reviewer_name": "Dave",
    "date": "Reviewed in the United States on May 11, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "nice and simple",
    "text_cleaned": "we purchased this mouse for the great price and lack of unnecessary buttons. my mom was always hitting the extra side buttons on other mice i bought her frustrating herself in the process. this follows the kiss principle, keep it simple! i would recommend this to anyone dealing with arthritis needing a simple mouse that is easy to use.",
    "date_cleaned": "2025-05-11",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.6292579174041748
  },
  {
    "title": "Good quality",
    "rating": "rating",
    "text": "I love this product. It has lasted me for a while and it gets the job done if you need an affordable mouse this is the one!",
    "reviewer_name": "Anthony",
    "date": "Reviewed in the United States on May 26, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "good quality",
    "text_cleaned": "i love this product. it has lasted me for a while and it gets the job done if you need an affordable mouse this is the one!",
    "date_cleaned": "2025-05-26",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.805261492729187
  },
  {
    "title": "Just got it...",
    "rating": "rating",
    "text": "This seems to be a good mouse, although I can't speak to longevity as I just got it. I would have given it 5 stars except that I have relatively large hands and it isn't quite as comfortable as my previous mouse - but that one died, and this one seems to be decent and well worth the price.",
    "reviewer_name": "SeeKeen",
    "date": "Reviewed in the United States on June 2, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "just got it...",
    "text_cleaned": "this seems to be a good mouse, although i can't speak to longevity as i just got it. i would have given it 5 stars except that i have relatively large hands and it isn't quite as comfortable as my previous mouse - but that one died, and this one seems to be decent and well worth the price.",
    "date_cleaned": "2025-06-02",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.8796542286872864
  },
  {
    "title": "When all you need is a cheap mouse ...",
    "rating": "rating",
    "text": "I paired this with a Raspberry Pi in my Ham shack. It does all I need it to do, and does it well enough to satisfy my needs. I use better mice with more expensive computers, some of which cost more than the RPi -- but they'd be overkill for this purpose.",
    "reviewer_name": "Walter Luffman",
    "date": "Reviewed in the United States on May 31, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "when all you need is a cheap mouse ...",
    "text_cleaned": "i paired this with a raspberry pi in my ham shack. it does all i need it to do, and does it well enough to satisfy my needs. i use better mice with more expensive computers, some of which cost more than the rpi -- but they'd be overkill for this purpose.",
    "date_cleaned": "2025-05-31",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.7033070921897888
  },
  {
    "title": "If this helps one person, it’s worth it.",
    "rating": "rating",
    "text": "I’ve bought this item multiple times. It works great and is normally the cheapest on the market. Here’s the catch: toward the end of its life (3 to 5 years), it can cause a weird glitch (I’m on an older iMac), which can be very hard to diagnose. Windows will slightly resize (almost a tiny spasm) and then the computer will slow down until it is almost unusable. Remove the mouse, replace it and you will be fine.",
    "reviewer_name": "DJ Frederick",
    "date": "Reviewed in the United States on May 12, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "if this helps one person, it’s worth it.",
    "text_cleaned": "i’ve bought this item multiple times. it works great and is normally the cheapest on the market. here’s the catch: toward the end of its life (3 to 5 years), it can cause a weird glitch (i’m on an older imac), which can be very hard to diagnose. windows will slightly resize (almost a tiny spasm) and then the computer will slow down until it is almost unusable. remove the mouse, replace it and you will be fine.",
    "date_cleaned": "2025-05-12",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.35611382126808167
  },
  {
    "title": "Works Well",
    "rating": "rating",
    "text": "A good mouse for a great price, thank you!",
    "reviewer_name": "Angela",
    "date": "Reviewed in the United States on June 3, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "works well",
    "text_cleaned": "a good mouse for a great price, thank you!",
    "date_cleaned": "2025-06-03",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.6266951560974121
  },
  {
    "title": "Mouse",
    "rating": "rating",
    "text": "De mis primeras compras por Amazon .. satisfecha",
    "reviewer_name": "Marilyn Salas",
    "date": "Reviewed in the United States on June 3, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "mouse",
    "text_cleaned": "de mis primeras compras por amazon .. satisfecha",
    "date_cleaned": "2025-06-03",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5792960524559021
  },
  {
    "title": "convenient",
    "rating": "rating",
    "text": "convenient for laptops... don't have to worry about batteries for wireless mouse",
    "reviewer_name": "GA Long Beach",
    "date": "Reviewed in the United States on June 2, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "convenient",
    "text_cleaned": "convenient for laptops... don't have to worry about batteries for wireless mouse",
    "date_cleaned": "2025-06-02",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.5832597613334656
  },
  {
    "title": "Works",
    "rating": "rating",
    "text": "Works fine. I wish Amazon would give us a gift card or something for reviews like other sites do. I try to give a lot of reviews",
    "reviewer_name": "Amazon Customer",
    "date": "Reviewed in the United States on May 16, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "works",
    "text_cleaned": "works fine. i wish amazon would give us a gift card or something for reviews like other sites do. i try to give a lot of reviews",
    "date_cleaned": "2025-05-16",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.6241310834884644
  },
  {
    "title": "excellent mouse",
    "rating": "rating",
    "text": "It's so basic yet so practical. The clicks are silent and satisfying at the same time, responds well to all movements, a true classic. It's not too big or too small, my hand size is very average, gripping it is so satisfying.",
    "reviewer_name": "Nicholas",
    "date": "Reviewed in the United States on May 11, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "excellent mouse",
    "text_cleaned": "it's so basic yet so practical. the clicks are silent and satisfying at the same time, responds well to all movements, a true classic. it's not too big or too small, my hand size is very average, gripping it is so satisfying.",
    "date_cleaned": "2025-05-11",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7758859395980835
  },
  {
    "title": "Scroll Wheel Failed after Two Years of INTENSIVE Use / Pretty Good Product",
    "rating": "rating",
    "text": "I like it. I use a wired mouse because I cannot be slowed down by changing batteries. It lasted almost two years to the day. The scroll wheel no longer works. As much as I use it, I cannot complain too much. It's a good mouse, a good price, just not sure what happened to the scroll wheel.",
    "reviewer_name": "Dartmouth Review",
    "date": "Reviewed in the United States on April 25, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "scroll wheel failed after two years of intensive use / pretty good product",
    "text_cleaned": "i like it. i use a wired mouse because i cannot be slowed down by changing batteries. it lasted almost two years to the day. the scroll wheel no longer works. as much as i use it, i cannot complain too much. it's a good mouse, a good price, just not sure what happened to the scroll wheel.",
    "date_cleaned": "2025-04-25",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.6349295973777771
  },
  {
    "title": "Great Purchase!",
    "rating": "rating",
    "text": "works great... fast deliver and excellent price.",
    "reviewer_name": "Originally a superb product. How does one purchase the quality product?",
    "date": "Reviewed in the United States on June 2, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great purchase!",
    "text_cleaned": "works great... fast deliver and excellent price.",
    "date_cleaned": "2025-06-02",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8084465265274048
  },
  {
    "title": "BASIC - versatile",
    "rating": "rating",
    "text": "EXCTLY AS DESCRIBED - BUY THESE EVERY FEW YEARS",
    "reviewer_name": "DianaQ",
    "date": "Reviewed in the United States on May 30, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "basic - versatile",
    "text_cleaned": "exctly as described - buy these every few years",
    "date_cleaned": "2025-05-30",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.777597963809967
  },
  {
    "title": "Good Wired Mouse.",
    "rating": "rating",
    "text": "Excellent corded mouse... I had not 1, not 2, But 3 wireless mouse failures... I got this one while waiting on new mice... It works well without any problem... It will be my backup for the next time. Very reliable mouse, Comfortable to use, Designed well as all Logitech mice are. This is wired, so no battery required. Buttons are positive feel and comfortable. I can see this mouse lasting a very long time!",
    "reviewer_name": "Sparkie",
    "date": "Reviewed in the United States on April 25, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good wired mouse.",
    "text_cleaned": "excellent corded mouse... i had not 1, not 2, but 3 wireless mouse failures... i got this one while waiting on new mice... it works well without any problem... it will be my backup for the next time. very reliable mouse, comfortable to use, designed well as all logitech mice are. this is wired, so no battery required. buttons are positive feel and comfortable. i can see this mouse lasting a very long time!",
    "date_cleaned": "2025-04-25",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8660099506378174
  },
  {
    "title": "works fine",
    "rating": "rating",
    "text": "Used this to setup a raspberry Pi.",
    "reviewer_name": "Alex P.",
    "date": "Reviewed in the United States on June 4, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "works fine",
    "text_cleaned": "used this to setup a raspberry pi.",
    "date_cleaned": "2025-06-04",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.45974528789520264
  },
  {
    "title": "Good item",
    "rating": "rating",
    "text": "Works good purchase 2x already due to my cat chewing on the cord",
    "reviewer_name": "Mary",
    "date": "Reviewed in the United States on May 20, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good item",
    "text_cleaned": "works good purchase 2x already due to my cat chewing on the cord",
    "date_cleaned": "2025-05-20",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4928865134716034
  },
  {
    "title": "what I like about my mouse purchase",
    "rating": "rating",
    "text": "I appreciate that the mouse is compact; I use it for long hours at a time. It's a great deal, with smooth scrolling, no battery needed, and it is durable.",
    "reviewer_name": "Karen Caldwell",
    "date": "Reviewed in the United States on May 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "what i like about my mouse purchase",
    "text_cleaned": "i appreciate that the mouse is compact; i use it for long hours at a time. it's a great deal, with smooth scrolling, no battery needed, and it is durable.",
    "date_cleaned": "2025-05-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.5099084973335266
  },
  {
    "title": "Funciona",
    "rating": "rating",
    "text": "Funciona, solo funciona",
    "reviewer_name": "Gabriel Ureña Perdomo",
    "date": "Reviewed in the United States on May 19, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "funciona",
    "text_cleaned": "funciona, solo funciona",
    "date_cleaned": "2025-05-19",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 1,
    "sentiment_score": 0.7661197185516357
  },
  {
    "title": "Cheap backup",
    "rating": "rating",
    "text": "Works well and a good price",
    "reviewer_name": "Robert",
    "date": "Reviewed in the United States on May 21, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "cheap backup",
    "text_cleaned": "works well and a good price",
    "date_cleaned": "2025-05-21",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.49584051966667175
  },
  {
    "title": "Excellent Deal from Start to Finish",
    "rating": "rating",
    "text": "Excellent Product, Excellent Price, Excellent Delivery Time! A++++",
    "reviewer_name": "B.A. Fenner of Tampa Bay, FL",
    "date": "Reviewed in the United States on May 20, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "excellent deal from start to finish",
    "text_cleaned": "excellent product, excellent price, excellent delivery time! a++++",
    "date_cleaned": "2025-05-20",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.9409775733947754
  },
  {
    "title": "Good, cheap USB mouse",
    "rating": "rating",
    "text": "It is what it is. There are times when you just need a quick, cheap mouse for a few minutes",
    "reviewer_name": "Steve S",
    "date": "Reviewed in the United States on May 11, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good, cheap usb mouse",
    "text_cleaned": "it is what it is. there are times when you just need a quick, cheap mouse for a few minutes",
    "date_cleaned": "2025-05-11",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4141656160354614
  },
  {
    "title": "Excellent value",
    "rating": "rating",
    "text": "I use this as my mouse when I'm working remotely. It's a steal at this price and it performs exactly as a mouse should.",
    "reviewer_name": "Riley",
    "date": "Reviewed in the United States on May 11, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "excellent value",
    "text_cleaned": "i use this as my mouse when i'm working remotely. it's a steal at this price and it performs exactly as a mouse should.",
    "date_cleaned": "2025-05-11",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7866821885108948
  },
  {
    "title": "Better and cheaper than my old one from Wal-Mart",
    "rating": "rating",
    "text": "Very quiet, moves smoothly",
    "reviewer_name": "Kris",
    "date": "Reviewed in the United States on May 24, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "better and cheaper than my old one from wal-mart",
    "text_cleaned": "very quiet, moves smoothly",
    "date_cleaned": "2025-05-24",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5222221612930298
  },
  {
    "title": "Very nice",
    "rating": "rating",
    "text": "Nice for my laptop",
    "reviewer_name": "Michael E. Gendron",
    "date": "Reviewed in the United States on May 17, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "very nice",
    "text_cleaned": "nice for my laptop",
    "date_cleaned": "2025-05-17",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.46356579661369324
  },
  {
    "title": "Old fashioned sometimes is better",
    "rating": "rating",
    "text": "I ordered 3 computer mice, 2 used a USB receiver, and one was this plug in style. I needed them quickly and when I opened the boxes to the 2 with the USB, the receivers were missing from both boxes. Thankfully this plug in one was easy peasy, plugged in and I have a workable mouse. I use my mouse with my left hand and so it is awkward for me to use the touchpad which is really made for right handed people. Old-fashioned is still in! Works great.",
    "reviewer_name": "J. Brown",
    "date": "Reviewed in the United States on March 26, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "old fashioned sometimes is better",
    "text_cleaned": "i ordered 3 computer mice, 2 used a usb receiver, and one was this plug in style. i needed them quickly and when i opened the boxes to the 2 with the usb, the receivers were missing from both boxes. thankfully this plug in one was easy peasy, plugged in and i have a workable mouse. i use my mouse with my left hand and so it is awkward for me to use the touchpad which is really made for right handed people. old-fashioned is still in! works great.",
    "date_cleaned": "2025-03-26",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7224803566932678
  },
  {
    "title": "thanks",
    "rating": "rating",
    "text": "nice",
    "reviewer_name": "lawrence hathaway jr",
    "date": "Reviewed in the United States on May 19, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "thanks",
    "text_cleaned": "nice",
    "date_cleaned": "2025-05-19",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4368409514427185
  },
  {
    "title": "Price",
    "rating": "rating",
    "text": "Good price",
    "reviewer_name": "Jane Mcneill",
    "date": "Reviewed in the United States on May 17, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "price",
    "text_cleaned": "good price",
    "date_cleaned": "2025-05-17",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4972047507762909
  },
  {
    "title": "LOVED THIS MOUSE",
    "rating": "rating",
    "text": "easy to attach to computer. GREAT FOR LADIES' HAND as it fits comfortably while in use/ Smooth moving. QUICK RESPONSE!",
    "reviewer_name": "Kindle Customer",
    "date": "Reviewed in the United States on May 3, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "loved this mouse",
    "text_cleaned": "easy to attach to computer. great for ladies' hand as it fits comfortably while in use/ smooth moving. quick response!",
    "date_cleaned": "2025-05-03",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5685898065567017
  },
  {
    "title": "It works as good as the factory original.",
    "rating": "rating",
    "text": "It works as good as the factory original.",
    "reviewer_name": "Steve M.",
    "date": "Reviewed in the United States on May 9, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "it works as good as the factory original.",
    "text_cleaned": "it works as good as the factory original.",
    "date_cleaned": "2025-05-09",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.539852499961853
  },
  {
    "title": "Good mouse",
    "rating": "rating",
    "text": "It’s an okay mouse, good for office use and for its price",
    "reviewer_name": "pietro02",
    "date": "Reviewed in the United States on April 19, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good mouse",
    "text_cleaned": "it’s an okay mouse, good for office use and for its price",
    "date_cleaned": "2025-04-19",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.739255964756012
  },
  {
    "title": "Good",
    "rating": "rating",
    "text": "Works well.",
    "reviewer_name": "Sajad Mazaheri",
    "date": "Reviewed in the United States on May 15, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good",
    "text_cleaned": "works well.",
    "date_cleaned": "2025-05-15",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4884435832500458
  },
  {
    "title": "Funciona muy bien",
    "rating": "rating",
    "text": "Perfecto, tamaño adecuado",
    "reviewer_name": "Kapc",
    "date": "Reviewed in the United States on May 11, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "funciona muy bien",
    "text_cleaned": "perfecto, tamaño adecuado",
    "date_cleaned": "2025-05-11",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7291542887687683
  },
  {
    "title": "Great and convenient",
    "rating": "rating",
    "text": "I highly recommend this, if you don’t like waisting your time trying to navigate with you finger.",
    "reviewer_name": "Santina",
    "date": "Reviewed in the United States on May 3, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great and convenient",
    "text_cleaned": "i highly recommend this, if you don’t like waisting your time trying to navigate with you finger.",
    "date_cleaned": "2025-05-03",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7196465730667114
  },
  {
    "title": "It’s way better than an Apple magic mouse!",
    "rating": "rating",
    "text": "A nice functional normal mouse to replace my Apple Magic Mouse that I hate.",
    "reviewer_name": "Kmm",
    "date": "Reviewed in the United States on April 16, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "it’s way better than an apple magic mouse!",
    "text_cleaned": "a nice functional normal mouse to replace my apple magic mouse that i hate.",
    "date_cleaned": "2025-04-16",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.5668240189552307
  },
  {
    "title": "But I need a backup Mouse and The Price is Right thanks guys great for a backup",
    "rating": "rating",
    "text": "Go to use this as a backup Mouse haven't used it but I will plug it in the tester but I need a backup Mouse and The Price is Right thanks",
    "reviewer_name": "Zo",
    "date": "Reviewed in the United States on April 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "but i need a backup mouse and the price is right thanks guys great for a backup",
    "text_cleaned": "go to use this as a backup mouse haven't used it but i will plug it in the tester but i need a backup mouse and the price is right thanks",
    "date_cleaned": "2025-04-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.43763381242752075
  },
  {
    "title": "Great basic mouse and I love it",
    "rating": "rating",
    "text": "This mouse works great, and it doesn't tell me what to do, like so much contemporary computer equipment is starting to do. It feels great in my hand and doesn't have extra buttons that get in the way, It has a chord, which I like as it doesn't have a battery and very little top go wrong.",
    "reviewer_name": "Byron Lacy",
    "date": "Reviewed in the United States on April 6, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "2 people found this helpful",
    "title_cleaned": "great basic mouse and i love it",
    "text_cleaned": "this mouse works great, and it doesn't tell me what to do, like so much contemporary computer equipment is starting to do. it feels great in my hand and doesn't have extra buttons that get in the way, it has a chord, which i like as it doesn't have a battery and very little top go wrong.",
    "date_cleaned": "2025-04-06",
    "verified_purchase_bool": true,
    "helpful_votes_count": 2,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.6206517219543457
  },
  {
    "title": "Vey Nice",
    "rating": "rating",
    "text": "I suggest buying this if you are in need of a mouse. It's cheap but very good quality.",
    "reviewer_name": "Ronald Ryan",
    "date": "Reviewed in the United States on April 25, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "vey nice",
    "text_cleaned": "i suggest buying this if you are in need of a mouse. it's cheap but very good quality.",
    "date_cleaned": "2025-04-25",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.49727654457092285
  },
  {
    "title": "last 6 years",
    "rating": "rating",
    "text": "It last for 6 years. now the right click switch often does not work, so time to replace.\nNothing specially good, but nothing was bad either. it was great for the price.",
    "reviewer_name": "KK",
    "date": "Reviewed in the United States on March 22, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "last 6 years",
    "text_cleaned": "it last for 6 years. now the right click switch often does not work, so time to replace.\nnothing specially good, but nothing was bad either. it was great for the price.",
    "date_cleaned": "2025-03-22",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.36002251505851746
  },
  {
    "title": "Computer mouse",
    "rating": "rating",
    "text": "It works perfectly if u need one I suggest to buy this one I love it it's moves smoothly",
    "reviewer_name": "Julia Quirindongo",
    "date": "Reviewed in the United States on April 23, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "computer mouse",
    "text_cleaned": "it works perfectly if u need one i suggest to buy this one i love it it's moves smoothly",
    "date_cleaned": "2025-04-23",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8249663710594177
  },
  {
    "title": "GREAT VALUE. WORKS PERFECTLY",
    "rating": "rating",
    "text": "GEAT VALUE. WORKS PERFECTLY",
    "reviewer_name": "judith",
    "date": "Reviewed in the United States on May 1, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great value. works perfectly",
    "text_cleaned": "geat value. works perfectly",
    "date_cleaned": "2025-05-01",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8054791688919067
  },
  {
    "title": "Good product",
    "rating": "rating",
    "text": "Smaller than dell, sometimes too sensitive",
    "reviewer_name": "whoolaaa",
    "date": "Reviewed in the United States on April 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "good product",
    "text_cleaned": "smaller than dell, sometimes too sensitive",
    "date_cleaned": "2025-04-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.5018423199653625
  },
  {
    "title": "good",
    "rating": "rating",
    "text": "good",
    "reviewer_name": "roseanne green",
    "date": "Reviewed in the United States on April 10, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "good",
    "text_cleaned": "good",
    "date_cleaned": "2025-04-10",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.49696311354637146
  },
  {
    "title": "It works!",
    "rating": "rating",
    "text": "It works! It's a smaller mouse but is doing everything perfectly. I got it for a Chromebook and it is plug 'n play.",
    "reviewer_name": "Silvia & Marcus",
    "date": "Reviewed in the United States on April 14, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "it works!",
    "text_cleaned": "it works! it's a smaller mouse but is doing everything perfectly. i got it for a chromebook and it is plug 'n play.",
    "date_cleaned": "2025-04-14",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.669592022895813
  },
  {
    "title": "Excellent product",
    "rating": "rating",
    "text": "Good size, easy to manuever, no difficulties with function.",
    "reviewer_name": "Angry customer",
    "date": "Reviewed in the United States on April 21, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "excellent product",
    "text_cleaned": "good size, easy to manuever, no difficulties with function.",
    "date_cleaned": "2025-04-21",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.4808584153652191
  },
  {
    "title": "Arguably the Best Mouse I've Used Over the Past Couple Plus Decades",
    "rating": "rating",
    "text": "My favoritest mouse ever! It's simple but so well designed. Great job Amazon! Very responsive. Nice click action. Last a long time. Excellently responsive. Feels good in my hand. Wired is good - avoid bad frequencies with wireless. Maybe one day we'll get healthier wireless.",
    "reviewer_name": "JohnChristopher",
    "date": "Reviewed in the United States on March 25, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "arguably the best mouse i've used over the past couple plus decades",
    "text_cleaned": "my favoritest mouse ever! it's simple but so well designed. great job amazon! very responsive. nice click action. last a long time. excellently responsive. feels good in my hand. wired is good - avoid bad frequencies with wireless. maybe one day we'll get healthier wireless.",
    "date_cleaned": "2025-03-25",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.962883472442627
  },
  {
    "title": "It works",
    "rating": "rating",
    "text": "It made a tablet work again.",
    "reviewer_name": "Lawrence Robinson",
    "date": "Reviewed in the United States on April 27, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "it works",
    "text_cleaned": "it made a tablet work again.",
    "date_cleaned": "2025-04-27",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.36668533086776733
  },
  {
    "title": "Scrolls like a mouse should",
    "rating": "rating",
    "text": "Ten times better than the mouses you get at the nickel stores.",
    "reviewer_name": "SvenStadt",
    "date": "Reviewed in the United States on April 16, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "scrolls like a mouse should",
    "text_cleaned": "ten times better than the mouses you get at the nickel stores.",
    "date_cleaned": "2025-04-16",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8307715654373169
  },
  {
    "title": "Worked great for almost 2 years",
    "rating": "rating",
    "text": "Had it for almost 2 years now and worked great until recently. Nothing major, just occasionally drops contact with the left click when trying to single click or click and drag.",
    "reviewer_name": "Patrick",
    "date": "Reviewed in the United States on March 8, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "worked great for almost 2 years",
    "text_cleaned": "had it for almost 2 years now and worked great until recently. nothing major, just occasionally drops contact with the left click when trying to single click or click and drag.",
    "date_cleaned": "2025-03-08",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.47909578680992126
  },
  {
    "title": "Work on linux",
    "rating": "rating",
    "text": "Work perfect on linux",
    "reviewer_name": "Bismarck",
    "date": "Reviewed in the United States on April 27, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "work on linux",
    "text_cleaned": "work perfect on linux",
    "date_cleaned": "2025-04-27",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7446648478507996
  },
  {
    "title": "WOW",
    "rating": "rating",
    "text": "I needed a mouse to do an online assessment that requires it for my schooling.\nHere I am thinking that I am being thrifty for buying a $9 dollar mouse at the neighborhood computer store. I go home, plug it in, and it does not work. So I go online to Amazon and I find an 'amazon basics' mouse for even cheaper. It was priced at $7 dollars and for an extra $2.25, they deliver it the same day. A couple hours later, I am startled to hear a knock on my door! What could it be? Well, It just happened to be the 'amazon basics' mouse that I ordered, no doubt. And the best part is that when I plugged it in, it worked right out of the box. No wonder these little shops have such trouble competing with Amazon!",
    "reviewer_name": "Tony H",
    "date": "Reviewed in the United States on January 17, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "wow",
    "text_cleaned": "i needed a mouse to do an online assessment that requires it for my schooling.\nhere i am thinking that i am being thrifty for buying a $9 dollar mouse at the neighborhood computer store. i go home, plug it in, and it does not work. so i go online to amazon and i find an 'amazon basics' mouse for even cheaper. it was priced at $7 dollars and for an extra $2.25, they deliver it the same day. a couple hours later, i am startled to hear a knock on my door! what could it be? well, it just happened to be the 'amazon basics' mouse that i ordered, no doubt. and the best part is that when i plugged it in, it worked right out of the box. no wonder these little shops have such trouble competing with amazon!",
    "date_cleaned": "2025-01-17",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 1,
    "sentiment_score": 0.48083677887916565
  },
  {
    "title": "Works Well, Quiet, Smooth Scrolling",
    "rating": "rating",
    "text": "This Amazon Basic wired mouse works just fine. It is quiet and scrolls smoothly, and it is relatively compact for travelling.",
    "reviewer_name": "Amazon Customer",
    "date": "Reviewed in the United States on April 10, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "works well, quiet, smooth scrolling",
    "text_cleaned": "this amazon basic wired mouse works just fine. it is quiet and scrolls smoothly, and it is relatively compact for travelling.",
    "date_cleaned": "2025-04-10",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4900299906730652
  },
  {
    "title": "Great mouse replacement.",
    "rating": "rating",
    "text": "Perfect mouse replacement.",
    "reviewer_name": "Viv",
    "date": "Reviewed in the United States on April 23, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great mouse replacement.",
    "text_cleaned": "perfect mouse replacement.",
    "date_cleaned": "2025-04-23",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8611172437667847
  },
  {
    "title": "You can't go wrong",
    "rating": "rating",
    "text": "Cheap but effective",
    "reviewer_name": "Nicolas Medel",
    "date": "Reviewed in the United States on April 19, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "you can't go wrong",
    "text_cleaned": "cheap but effective",
    "date_cleaned": "2025-04-19",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4691154360771179
  },
  {
    "title": "Works great, but for small hands",
    "rating": "rating",
    "text": "Giving this a 4-star, simply because it is not a \"full-sized\" mouse. For children or adults with small hands, this would be 100% perfect. But my hand \"swallowed\" this mouse, so I returned it and got B08P6FXKP9 instead.",
    "reviewer_name": "Robert & Rebecca Neel",
    "date": "Reviewed in the United States on February 23, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "works great, but for small hands",
    "text_cleaned": "giving this a 4-star, simply because it is not a \"full-sized\" mouse. for children or adults with small hands, this would be 100% perfect. but my hand \"swallowed\" this mouse, so i returned it and got b08p6fxkp9 instead.",
    "date_cleaned": "2025-02-23",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.8069443702697754
  },
  {
    "title": "Winner take all! Tough little guy! Here I come to save the day!",
    "rating": "rating",
    "text": "I am writing this review with my feisty little friend, mighty mouse, the longest lasting of many different types and sizes I bought when my hp mouse gave up the ghost during Covid, and I realized I would be spending a lot of extra time on my pc. All of the zippy vertical, super-fast, ergonomic, oversized, competition, gamer, blah blah, fill in the blank, electronic marsupials failed early except this one. Granted, it seems a little small, but sometimes this is better to minimize large wrist movements that can be done with just finger movements (I made do and got used to it and grew to like it!). And I got tired of trashing the not so high techs! most of which just moved the pain and then committed hara-kiri. If I were a gamer, I might think otherwise. I have grown fond of my loyal little friend, mighty, who, after all, is a survivor and has come to save the day! Good boy! Fetch! (something from Amazon?).",
    "reviewer_name": "JimLu review",
    "date": "Reviewed in the United States on December 18, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "2 people found this helpful",
    "title_cleaned": "winner take all! tough little guy! here i come to save the day!",
    "text_cleaned": "i am writing this review with my feisty little friend, mighty mouse, the longest lasting of many different types and sizes i bought when my hp mouse gave up the ghost during covid, and i realized i would be spending a lot of extra time on my pc. all of the zippy vertical, super-fast, ergonomic, oversized, competition, gamer, blah blah, fill in the blank, electronic marsupials failed early except this one. granted, it seems a little small, but sometimes this is better to minimize large wrist movements that can be done with just finger movements (i made do and got used to it and grew to like it!). and i got tired of trashing the not so high techs! most of which just moved the pain and then committed hara-kiri. if i were a gamer, i might think otherwise. i have grown fond of my loyal little friend, mighty, who, after all, is a survivor and has come to save the day! good boy! fetch! (something from amazon?).",
    "date_cleaned": "2024-12-18",
    "verified_purchase_bool": true,
    "helpful_votes_count": 2,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.29999667406082153
  },
  {
    "title": "Its presence is not felt",
    "rating": "rating",
    "text": "Like a natural part of the body :) Quiet and smooth.",
    "reviewer_name": "ETO",
    "date": "Reviewed in the United States on April 13, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "its presence is not felt",
    "text_cleaned": "like a natural part of the body :) quiet and smooth.",
    "date_cleaned": "2025-04-13",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.6223978400230408
  },
  {
    "title": "Better than my wireless mouses....",
    "rating": "rating",
    "text": "I had using so many mouses before. Either wireless or wire. This wire one is durable and great performance. Highly recommend!",
    "reviewer_name": "Rachel",
    "date": "Reviewed in the United States on April 9, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "better than my wireless mouses....",
    "text_cleaned": "i had using so many mouses before. either wireless or wire. this wire one is durable and great performance. highly recommend!",
    "date_cleaned": "2025-04-09",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.9549932479858398
  },
  {
    "title": "happy",
    "rating": "rating",
    "text": "works fine",
    "reviewer_name": "charles r franks jr Chuck",
    "date": "Reviewed in the United States on April 21, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "happy",
    "text_cleaned": "works fine",
    "date_cleaned": "2025-04-21",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.5150192379951477
  },
  {
    "title": "Needed a single wired mouse.",
    "rating": "rating",
    "text": "Works great.",
    "reviewer_name": "Jack Serany",
    "date": "Reviewed in the United States on April 21, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "needed a single wired mouse.",
    "text_cleaned": "works great.",
    "date_cleaned": "2025-04-21",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.695447564125061
  },
  {
    "title": "Responsive mouse",
    "rating": "rating",
    "text": "This mouse is responsive and good quality. I cannot, however, give it five stars in good conscience, considering that it bears the inscription \"Amazon Basics,\" a company owned by a man who has a net worth in excess of 170 billion dollars, when this money could be used to make massive inroads in stopping climate change, a massive human catastrophe that is and will continue to kill countless people.",
    "reviewer_name": "D. L. Corvin",
    "date": "Reviewed in the United States on January 17, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "responsive mouse",
    "text_cleaned": "this mouse is responsive and good quality. i cannot, however, give it five stars in good conscience, considering that it bears the inscription \"amazon basics,\" a company owned by a man who has a net worth in excess of 170 billion dollars, when this money could be used to make massive inroads in stopping climate change, a massive human catastrophe that is and will continue to kill countless people.",
    "date_cleaned": "2025-01-17",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.8295121788978577
  },
  {
    "title": "It features the standard left and right clicks, a scroll wheel, and a wired USB connection",
    "rating": "rating",
    "text": "I recently purchased three of the Amazon Basics 3-Button Wired USB Mouse in black. While I wasn't expecting any bells and whistles with this budget-friendly option, I've been pleasantly surprised by its functionality and performance. I use it for my lap top computer because I like the ease of using a mouse compared to finger application.\n\nStraightforward Setup and Use\n\nThis mouse is as advertised: a basic, 3-button wired mouse. It features the standard left and right clicks, a scroll wheel, and a wired USB connection. Setting it up is a breeze - simply plug it into your USB port, and you're ready to go. No drivers or software installation required.\n\nPerfect for Everyday Tasks and Budget-Conscious Gamers\n\nThe 1000 DPI optical tracking provides smooth cursor control, making it sufficient for everyday computer tasks like browsing, emailing, and navigating documents. It's a great option for someone who needs a simple, reliable mouse for basic use.\n\nOne surprising perk? My grandson, a passionate but budget-conscious gamer, has actually been using one of these mice for his gaming sessions. While it obviously lacks the fancy features of a high-end gaming mouse, he reports that it performs surprisingly well for casual gaming, especially considering the price point.\n\nSolid Value for Everyday Use\n\nOverall, the AmazonBasics 3-Button Wired USB Mouse is a solid value for everyday computer use. It's particularly attractive for those looking for a simple, affordable option or even a backup mouse. Gamers on a tight budget might also find it surprisingly functional for casual gaming.\n\nJust keep in mind that this is a basic mouse with a wired connection. If you're looking for a wireless mouse with extra buttons and programmable features, this might not be the best choice for you. But if you need a simple, reliable mouse at a great price, the Amazon Basics 3-Button Wired USB Mouse definitely fits the bill.",
    "reviewer_name": "Naturallyzee",
    "date": "Reviewed in the United States on June 17, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "17 people found this helpful",
    "title_cleaned": "it features the standard left and right clicks, a scroll wheel, and a wired usb connection",
    "text_cleaned": "i recently purchased three of the amazon basics 3-button wired usb mouse in black. while i wasn't expecting any bells and whistles with this budget-friendly option, i've been pleasantly surprised by its functionality and performance. i use it for my lap top computer because i like the ease of using a mouse compared to finger application.\n\nstraightforward setup and use\n\nthis mouse is as advertised: a basic, 3-button wired mouse. it features the standard left and right clicks, a scroll wheel, and a wired usb connection. setting it up is a breeze - simply plug it into your usb port, and you're ready to go. no drivers or software installation required.\n\nperfect for everyday tasks and budget-conscious gamers\n\nthe 1000 dpi optical tracking provides smooth cursor control, making it sufficient for everyday computer tasks like browsing, emailing, and navigating documents. it's a great option for someone who needs a simple, reliable mouse for basic use.\n\none surprising perk? my grandson, a passionate but budget-conscious gamer, has actually been using one of these mice for his gaming sessions. while it obviously lacks the fancy features of a high-end gaming mouse, he reports that it performs surprisingly well for casual gaming, especially considering the price point.\n\nsolid value for everyday use\n\noverall, the amazonbasics 3-button wired usb mouse is a solid value for everyday computer use. it's particularly attractive for those looking for a simple, affordable option or even a backup mouse. gamers on a tight budget might also find it surprisingly functional for casual gaming.\n\njust keep in mind that this is a basic mouse with a wired connection. if you're looking for a wireless mouse with extra buttons and programmable features, this might not be the best choice for you. but if you need a simple, reliable mouse at a great price, the amazon basics 3-button wired usb mouse definitely fits the bill.",
    "date_cleaned": "2024-06-17",
    "verified_purchase_bool": true,
    "helpful_votes_count": 17,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5135101675987244
  },
  {
    "title": "It does when it’s supposed to do",
    "rating": "rating",
    "text": "Great mouse very sensitive good size very durable just as good as a namebrand mouse",
    "reviewer_name": "Eric Hills",
    "date": "Reviewed in the United States on April 6, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "it does when it’s supposed to do",
    "text_cleaned": "great mouse very sensitive good size very durable just as good as a namebrand mouse",
    "date_cleaned": "2025-04-06",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7552314400672913
  },
  {
    "title": "Good Longegivity",
    "rating": "rating",
    "text": "Bought this mouse in 2019. Performed well until mid 2024 when I noticed the sensitivity decrease. It still worked but I would need to press down harder and it would sometimes \"let go\" of things when I try dragging them across the screen.\n\nConsidering it almost lasted five years before a decline in performance, I'd say this is a good deal.",
    "reviewer_name": "M",
    "date": "Reviewed in the United States on January 19, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good longegivity",
    "text_cleaned": "bought this mouse in 2019. performed well until mid 2024 when i noticed the sensitivity decrease. it still worked but i would need to press down harder and it would sometimes \"let go\" of things when i try dragging them across the screen.\n\nconsidering it almost lasted five years before a decline in performance, i'd say this is a good deal.",
    "date_cleaned": "2025-01-19",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.44529879093170166
  },
  {
    "title": "Good value for the price, Arrived the next day (PRIME)",
    "rating": "rating",
    "text": "Nice basic wired mouse. Good price I got 2.\nAlready dropped on the floor twice with no ill effects.",
    "reviewer_name": "booklover",
    "date": "Reviewed in the United States on April 6, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good value for the price, arrived the next day (prime)",
    "text_cleaned": "nice basic wired mouse. good price i got 2.\nalready dropped on the floor twice with no ill effects.",
    "date_cleaned": "2025-04-06",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.538131833076477
  },
  {
    "title": "Good for the cost",
    "rating": "rating",
    "text": "Not bad at all for the cost.",
    "reviewer_name": "Hunter",
    "date": "Reviewed in the United States on March 14, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good for the cost",
    "text_cleaned": "not bad at all for the cost.",
    "date_cleaned": "2025-03-14",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4788486659526825
  },
  {
    "title": "Buen producto",
    "rating": "rating",
    "text": "Buen funcionamiento",
    "reviewer_name": "Victor Hugo Ortiz Diaz",
    "date": "Reviewed in the United States on April 16, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "buen producto",
    "text_cleaned": "buen funcionamiento",
    "date_cleaned": "2025-04-16",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4537746012210846
  },
  {
    "title": "Useful and basic",
    "rating": "rating",
    "text": "Very basic, wired mouse. I have purchased this twice for our home computers.",
    "reviewer_name": "mighty mouse",
    "date": "Reviewed in the United States on April 8, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "useful and basic",
    "text_cleaned": "very basic, wired mouse. i have purchased this twice for our home computers.",
    "date_cleaned": "2025-04-08",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.4619520306587219
  },
  {
    "title": "Wired connected mouse works great!",
    "rating": "rating",
    "text": "This simple wired connected mouse works GREAT on my somewhat old Mac laptop. I plugged it into my USB port, adjusted the mouse setting on the Mac, and it has worked flawlessly ever since.",
    "reviewer_name": "K3HME",
    "date": "Reviewed in the United States on March 25, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "wired connected mouse works great!",
    "text_cleaned": "this simple wired connected mouse works great on my somewhat old mac laptop. i plugged it into my usb port, adjusted the mouse setting on the mac, and it has worked flawlessly ever since.",
    "date_cleaned": "2025-03-25",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8014166355133057
  },
  {
    "title": "Most comfortable mouse among my collection",
    "rating": "rating",
    "text": "I have purchased mouse often, changing model or style, cheapest to expensive. Somehow no mouse could satisfy me and after years of intense computer work I reached a conclusion no mouse will work well for me. Some models were big, heavy, difficult to click with little effort, required often cleaning, would not work well on certain mouse pads. No single model felt well in my hand. After years on different jobs I stopped paying attention. Mouse become part of hardship at work, something I did not care anymore. After years a moment arrived I needed a quiet mouse, positively quiet. So clicking and moving mouse will not add to sound I apply for testing microphones. Start testing, one click, a moment later Stop testing, second click. I noticed some mouse clicks were too loud for my measurements, changed microphone plots. I had to work with louder test setup or obtain quieter mouse. Changing mousepad did not make things better for each mouse model I investigated. So a few years ago in desperation I purchased some fancy, expensive models and very cheap, generic models. I put all mice to testing, without labeling them, to avoid any bias. I quickly rejected most fancy models, some elegant white finish mouse was just no good for me. Two models performed best and one of them is my favorite now, Amazon Basics. After a few years I confirmed this model worked for me and all test benches at work liked it for being quiet. I purchased 5 more. This mouse here, Amazon Basics really works best for me. Least effort needed to click, mouse felt perfect in my hand, ergonomic to my hand that is rather medium size toward small. Clicks sound is acceptable to my measurements, performance is equally quiet on mouse pad, on plain table surface and on randomly picked surfaces near always overcrowded test benches. Mouse moves steadily on each surface, it is always reliable. I use many computer models, USB port flavors, Windows from 7 to 11. This mouse always works just when plugged, I never had compatibility issue. I used it also on dusty table surface, never a problem. Most critical task for me is designing of layout for electronics components with size between 1mm and 0.1mm, where I need big zoom on the scree and mouse needs to use it's high end of resolution. No problem here, very smooth operation as always. Mouse is lightweight, usually lightweight I associate with \"cheap plastics\" products. Not such perception here, due to my comfort and proven performance.",
    "reviewer_name": "Peter Sobczak",
    "date": "Reviewed in the United States on August 4, 2022",
    "verified_purchase": "Yes",
    "helpful_votes": "56 people found this helpful",
    "title_cleaned": "most comfortable mouse among my collection",
    "text_cleaned": "i have purchased mouse often, changing model or style, cheapest to expensive. somehow no mouse could satisfy me and after years of intense computer work i reached a conclusion no mouse will work well for me. some models were big, heavy, difficult to click with little effort, required often cleaning, would not work well on certain mouse pads. no single model felt well in my hand. after years on different jobs i stopped paying attention. mouse become part of hardship at work, something i did not care anymore. after years a moment arrived i needed a quiet mouse, positively quiet. so clicking and moving mouse will not add to sound i apply for testing microphones. start testing, one click, a moment later stop testing, second click. i noticed some mouse clicks were too loud for my measurements, changed microphone plots. i had to work with louder test setup or obtain quieter mouse. changing mousepad did not make things better for each mouse model i investigated. so a few years ago in desperation i purchased some fancy, expensive models and very cheap, generic models. i put all mice to testing, without labeling them, to avoid any bias. i quickly rejected most fancy models, some elegant white finish mouse was just no good for me. two models performed best and one of them is my favorite now, amazon basics. after a few years i confirmed this model worked for me and all test benches at work liked it for being quiet. i purchased 5 more. this mouse here, amazon basics really works best for me. least effort needed to click, mouse felt perfect in my hand, ergonomic to my hand that is rather medium size toward small. clicks sound is acceptable to my measurements, performance is equally quiet on mouse pad, on plain table surface and on randomly picked surfaces near always overcrowded test benches. mouse moves steadily on each surface, it is always reliable. i use many computer models, usb port flavors, windows from 7 to 11. this mouse always works just when plugged, i never had compatibility issue. i used it also on dusty table surface, never a problem. most critical task for me is designing of layout for electronics components with size between 1mm and 0.1mm, where i need big zoom on the scree and mouse needs to use it's high end of resolution. no problem here, very smooth operation as always. mouse is lightweight, usually lightweight i associate with \"cheap plastics\" products. not such perception here, due to my comfort and proven performance.",
    "date_cleaned": "2022-08-04",
    "verified_purchase_bool": true,
    "helpful_votes_count": 56,
    "rating_processed": "rating",
    "sentiment_stars": 2,
    "sentiment_score": 0.5467506051063538
  },
  {
    "title": "Nice buy",
    "rating": "rating",
    "text": "It was delivered quickly and it works just fine. At an affordable price, what's not to like.",
    "reviewer_name": "Dale Harkleroad",
    "date": "Reviewed in the United States on April 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "nice buy",
    "text_cleaned": "it was delivered quickly and it works just fine. at an affordable price, what's not to like.",
    "date_cleaned": "2025-04-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.5306193828582764
  },
  {
    "title": "Goes bad after a few years",
    "rating": "rating",
    "text": "Getting ready to order my 3d one It's cheap and works okay - does what it is supposed to do. But after a few years the two that I have bought started double clicking That's why I am getting ready to replace the one I am now using.",
    "reviewer_name": "Boneshaker",
    "date": "Reviewed in the United States on May 25, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "goes bad after a few years",
    "text_cleaned": "getting ready to order my 3d one it's cheap and works okay - does what it is supposed to do. but after a few years the two that i have bought started double clicking that's why i am getting ready to replace the one i am now using.",
    "date_cleaned": "2025-05-25",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.600135862827301
  },
  {
    "title": "Just a good cheap mouse that works!",
    "rating": "rating",
    "text": "Perfect! Just what I need for my operation here.",
    "reviewer_name": "Raymond Alex",
    "date": "Reviewed in the United States on April 6, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "just a good cheap mouse that works!",
    "text_cleaned": "perfect! just what i need for my operation here.",
    "date_cleaned": "2025-04-06",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.9546093940734863
  },
  {
    "title": "Works",
    "rating": "rating",
    "text": "Works. Tossed the old one, had a short.",
    "reviewer_name": "SB Cheek",
    "date": "Reviewed in the United States on March 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "works",
    "text_cleaned": "works. tossed the old one, had a short.",
    "date_cleaned": "2025-03-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4418111741542816
  },
  {
    "title": "good quality",
    "rating": "rating",
    "text": "annoying sound of scroll",
    "reviewer_name": "Ahmed",
    "date": "Reviewed in the United States on March 3, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "good quality",
    "text_cleaned": "annoying sound of scroll",
    "date_cleaned": "2025-03-03",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 2,
    "sentiment_score": 0.45901599526405334
  },
  {
    "title": "Inexpensive Mouse; You get what you pay for.",
    "rating": "rating",
    "text": "They last a year and then you have to buy a new one. I use mine daily for work; Do not abuse or mishandle it. No issues with the mouse when it's working. It functions as it should; Movement is smooth.\n\nThank goodness that it is inexpensive so it's not difficult to replace; it's just very annoying that it doesn't last longer.",
    "reviewer_name": "C. Stafford",
    "date": "Reviewed in the United States on May 11, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "inexpensive mouse; you get what you pay for.",
    "text_cleaned": "they last a year and then you have to buy a new one. i use mine daily for work; do not abuse or mishandle it. no issues with the mouse when it's working. it functions as it should; movement is smooth.\n\nthank goodness that it is inexpensive so it's not difficult to replace; it's just very annoying that it doesn't last longer.",
    "date_cleaned": "2025-05-11",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.4215056002140045
  },
  {
    "title": "The \"Bring Home the Bacon\" Work Mouse: A No-Frills, Excellent Daily Driver.",
    "rating": "rating",
    "text": "Fellow Dads,feast your eyes on the Amazon Basics Mouse – the trusty steed in the realm of everyday digital hustle. This isn't just a mouse; it's a testament to the \"get-er-done\" ethos that powers through spreadsheets, homework, and those endless email threads with the finesse of a well-oiled machine.\n\nLet's cut to the chase: it's ultralight, making you wonder if Amazon discovered anti-gravity tech. Yet, it feels as reliable as that old family wagon, boasting a solid one-piece construction that resonates with a reassuring solidity at every tap. The clicks? They're the muted thuds of determination, ensuring you can work through nap times without waking the baby. And the scroll wheel, with its gentle rumbles, feels like cruising down the information highway with the top down.\n\nI've plugged this trooper into every computer in the house, tested it on desks, different pads, and even the kitchen counter – it just works. The cable's as steadfast as your commitment to Sunday family brunch, and the glide pads beneath? They ensure smooth sailing across many different landscapes, minimal yet mighty.\n\n\"Made in China,\" this mouse doesn't shy away from its roots, delivering an affordable, no-compromise tool that checks every box. Medium-sized for universal fit, it's the Goldilocks of mice - not too big, not too small, just right for the bulk of the population.\n\nWhy did I buy a case of 30? Because when you find something that works this well at keeping the daily grind moving, and need an affordable mouse this is it! It's the workhorse mouse that metaphorically \"brings home the bacon,\" fueling your day without draining the wallet.\n\nInitial look: for the huge selection of mouse out there this does not fall short for what you pay and what you get with the soft touch paint solid construction, high-quality wiring, good plug pads, decent laser, tracking, muted, click buttons muted, scroll wheel, and good size makes it a good purchase. Hope this is helpful in your decision. More updates to follow.",
    "reviewer_name": "Matt",
    "date": "Reviewed in the United States on March 21, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "43 people found this helpful",
    "title_cleaned": "the \"bring home the bacon\" work mouse: a no-frills, excellent daily driver.",
    "text_cleaned": "fellow dads,feast your eyes on the amazon basics mouse – the trusty steed in the realm of everyday digital hustle. this isn't just a mouse; it's a testament to the \"get-er-done\" ethos that powers through spreadsheets, homework, and those endless email threads with the finesse of a well-oiled machine.\n\nlet's cut to the chase: it's ultralight, making you wonder if amazon discovered anti-gravity tech. yet, it feels as reliable as that old family wagon, boasting a solid one-piece construction that resonates with a reassuring solidity at every tap. the clicks? they're the muted thuds of determination, ensuring you can work through nap times without waking the baby. and the scroll wheel, with its gentle rumbles, feels like cruising down the information highway with the top down.\n\ni've plugged this trooper into every computer in the house, tested it on desks, different pads, and even the kitchen counter – it just works. the cable's as steadfast as your commitment to sunday family brunch, and the glide pads beneath? they ensure smooth sailing across many different landscapes, minimal yet mighty.\n\n\"made in china,\" this mouse doesn't shy away from its roots, delivering an affordable, no-compromise tool that checks every box. medium-sized for universal fit, it's the goldilocks of mice - not too big, not too small, just right for the bulk of the population.\n\nwhy did i buy a case of 30? because when you find something that works this well at keeping the daily grind moving, and need an affordable mouse this is it! it's the workhorse mouse that metaphorically \"brings home the bacon,\" fueling your day without draining the wallet.\n\ninitial look: for the huge selection of mouse out there this does not fall short for what you pay and what you get with the soft touch paint solid construction, high-quality wiring, good plug pads, decent laser, tracking, muted, click buttons muted, scroll wheel, and good size makes it a good purchase. hope this is helpful in your decision. more updates to follow.",
    "date_cleaned": "2024-03-21",
    "verified_purchase_bool": true,
    "helpful_votes_count": 43,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.42758259177207947
  },
  {
    "title": "A Boomer Treasure!",
    "rating": "rating",
    "text": "Very good product for Boomers who still use a mouse! Love this!!!!",
    "reviewer_name": "Cindy Caporaso",
    "date": "Reviewed in the United States on April 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "a boomer treasure!",
    "text_cleaned": "very good product for boomers who still use a mouse! love this!!!!",
    "date_cleaned": "2025-04-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.726502001285553
  },
  {
    "title": "Great mouse for the price compare to other brands.",
    "rating": "rating",
    "text": "Easy use",
    "reviewer_name": "Kike",
    "date": "Reviewed in the United States on April 10, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great mouse for the price compare to other brands.",
    "text_cleaned": "easy use",
    "date_cleaned": "2025-04-10",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.4833180904388428
  },
  {
    "title": "great mouse",
    "rating": "rating",
    "text": "This is the only mouse in the ones I have that is currently working. It is in fine working order without any issues.",
    "reviewer_name": "Dee",
    "date": "Reviewed in the United States on January 13, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great mouse",
    "text_cleaned": "this is the only mouse in the ones i have that is currently working. it is in fine working order without any issues.",
    "date_cleaned": "2025-01-13",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5208992958068848
  },
  {
    "title": "smaller than the \"standard\" mouse",
    "rating": "rating",
    "text": "It works fine, seems like it will last (although the cord isn't quite as rugged as some), and the cord is a good length.\n\nOne potentially important thing, however: it's considerably smaller and lighter than the ubiquitous \"Microsoft mouse\" (and all the similar, feel-alike models). It's not tiny, but it definitely has a different feel to it and it takes a little bit of getting used to. This can be a good thing: it doesn't take up as much space in your backpack, if you need to carry it with you. But I imagine that for some people (maybe gamers who use the mouse, or people doing graphic design who need fine control) the difference in size and weight could be an issue, because it definitely feels different.",
    "reviewer_name": "DannyO",
    "date": "Reviewed in the United States on December 8, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "2 people found this helpful",
    "title_cleaned": "smaller than the \"standard\" mouse",
    "text_cleaned": "it works fine, seems like it will last (although the cord isn't quite as rugged as some), and the cord is a good length.\n\none potentially important thing, however: it's considerably smaller and lighter than the ubiquitous \"microsoft mouse\" (and all the similar, feel-alike models). it's not tiny, but it definitely has a different feel to it and it takes a little bit of getting used to. this can be a good thing: it doesn't take up as much space in your backpack, if you need to carry it with you. but i imagine that for some people (maybe gamers who use the mouse, or people doing graphic design who need fine control) the difference in size and weight could be an issue, because it definitely feels different.",
    "date_cleaned": "2024-12-08",
    "verified_purchase_bool": true,
    "helpful_votes_count": 2,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.6616654396057129
  },
  {
    "title": "good deal for price",
    "rating": "rating",
    "text": "works very well",
    "reviewer_name": "Ronald Tirino",
    "date": "Reviewed in the United States on February 15, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good deal for price",
    "text_cleaned": "works very well",
    "date_cleaned": "2025-02-15",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.6456440091133118
  },
  {
    "title": "Great value",
    "rating": "rating",
    "text": "For a wired mouse. Very comfortable and quite durable. Connectivity is straight forward as it plugs in via USB port. Buttons operate smoothly. Excellent scrolling as center wheel is smooth.",
    "reviewer_name": "DavidLMO",
    "date": "Reviewed in the United States on January 5, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "great value",
    "text_cleaned": "for a wired mouse. very comfortable and quite durable. connectivity is straight forward as it plugs in via usb port. buttons operate smoothly. excellent scrolling as center wheel is smooth.",
    "date_cleaned": "2025-01-05",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.7695584893226624
  },
  {
    "title": "Thank you",
    "rating": "rating",
    "text": "good used product",
    "reviewer_name": "Pang lee",
    "date": "Reviewed in the United States on April 2, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "thank you",
    "text_cleaned": "good used product",
    "date_cleaned": "2025-04-02",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.546422004699707
  },
  {
    "title": "A CORDLESS MOUSE IS JUNK",
    "rating": "rating",
    "text": "I have been using cordless mice for a while and i really don't like the performance of them. I bought this corded mouse and its a great deal easier to use and not so dam unreliable. NO more of them cordless mice for me",
    "reviewer_name": "LYLE SNOW",
    "date": "Reviewed in the United States on February 28, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "a cordless mouse is junk",
    "text_cleaned": "i have been using cordless mice for a while and i really don't like the performance of them. i bought this corded mouse and its a great deal easier to use and not so dam unreliable. no more of them cordless mice for me",
    "date_cleaned": "2025-02-28",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 2,
    "sentiment_score": 0.5284107327461243
  },
  {
    "title": "Works fine but died after only 2 years",
    "rating": "rating",
    "text": "I used this as a mouse for my laptop. As a mouse, it was reliable and accurate. However, it died after 2 years of fairly light use (no gaming, used for a few hours at a time one day a week or so). Not sure what went wrong, but my Macbook says that the voltage is not regulated correctly. Nothing visibly damaged, but it no longer works on any computer. Most of my other mice have lasted closer to 5-10 years, but at this price, hard to complain.",
    "reviewer_name": "J. L.",
    "date": "Reviewed in the United States on November 1, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "One person found this helpful",
    "title_cleaned": "works fine but died after only 2 years",
    "text_cleaned": "i used this as a mouse for my laptop. as a mouse, it was reliable and accurate. however, it died after 2 years of fairly light use (no gaming, used for a few hours at a time one day a week or so). not sure what went wrong, but my macbook says that the voltage is not regulated correctly. nothing visibly damaged, but it no longer works on any computer. most of my other mice have lasted closer to 5-10 years, but at this price, hard to complain.",
    "date_cleaned": "2024-11-01",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 2,
    "sentiment_score": 0.5562458038330078
  },
  {
    "title": "Good",
    "rating": "rating",
    "text": "Works well, good durability, it’s very quiet, fits my hand well, and the scroll wheel is very good for a longer time",
    "reviewer_name": "Cheyenne Philpott",
    "date": "Reviewed in the United States on March 18, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good",
    "text_cleaned": "works well, good durability, it’s very quiet, fits my hand well, and the scroll wheel is very good for a longer time",
    "date_cleaned": "2025-03-18",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.5668473243713379
  },
  {
    "title": "Cable too short",
    "rating": "rating",
    "text": "Cable is short but that is my fault for not reading.",
    "reviewer_name": "Glenn M",
    "date": "Reviewed in the United States on January 28, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "cable too short",
    "text_cleaned": "cable is short but that is my fault for not reading.",
    "date_cleaned": "2025-01-28",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.3569296598434448
  },
  {
    "title": "You get what you pay for",
    "rating": "rating",
    "text": "It's not the fanciest electronic gadget out there. Does what a mouse is supposed to do. It moves your page up and down and from side to side. But will give you a real hard time when you're trying to highlight text and will force you to make several attempts at it before getting the job done, which can be quite frustrating. Outside of that, it's an okay mouse.",
    "reviewer_name": "Cassandra B.",
    "date": "Reviewed in the United States on April 7, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "you get what you pay for",
    "text_cleaned": "it's not the fanciest electronic gadget out there. does what a mouse is supposed to do. it moves your page up and down and from side to side. but will give you a real hard time when you're trying to highlight text and will force you to make several attempts at it before getting the job done, which can be quite frustrating. outside of that, it's an okay mouse.",
    "date_cleaned": "2025-04-07",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.7806480526924133
  },
  {
    "title": "Good quality for the price.",
    "rating": "rating",
    "text": "For the price it seems to be good quality. It's comfortable and the scroll wheel works well.",
    "reviewer_name": "S.Rose",
    "date": "Reviewed in the United States on March 17, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "good quality for the price.",
    "text_cleaned": "for the price it seems to be good quality. it's comfortable and the scroll wheel works well.",
    "date_cleaned": "2025-03-17",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 4,
    "sentiment_score": 0.6636461615562439
  },
  {
    "title": "Lightweight",
    "rating": "rating",
    "text": "I have been using this mouse for a little over a year, and I like its light weight, which is easier on my hand/wrist. The buttons and wheel still work well, but I have started noticing in the past few weeks that the pointer sometimes jumps, even though I am not moving the mouse. It may be time for a replacement already.",
    "reviewer_name": "Gesundheit",
    "date": "Reviewed in the United States on December 2, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "lightweight",
    "text_cleaned": "i have been using this mouse for a little over a year, and i like its light weight, which is easier on my hand/wrist. the buttons and wheel still work well, but i have started noticing in the past few weeks that the pointer sometimes jumps, even though i am not moving the mouse. it may be time for a replacement already.",
    "date_cleaned": "2024-12-02",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 3,
    "sentiment_score": 0.5241681337356567
  },
  {
    "title": "Reliable, Comfortable, and Great Value for a Wired Mouse!",
    "rating": "rating",
    "text": "This Amazon Basics 3-Button Wired USB Mouse has been a fantastic addition to my setup. It’s straightforward, plug-and-play, and works perfectly on both my laptop and desktop without needing any software installation. The tracking is surprisingly responsive, and I find the scroll wheel smooth and easy to control, which is great for browsing and document work.\n\nThe size and shape of the mouse fit comfortably in my hand, even during extended use, and I appreciate the simple, no-frills design. The USB connection is reliable, so I never experience delays or dropped connections, which can be an issue with wireless mice. For a basic mouse, this Amazon Basics option really exceeded my expectations and is unbeatable for the price. If you’re looking for a solid, no-nonsense wired mouse, I’d definitely recommend this one!",
    "reviewer_name": "Ken Krempetz",
    "date": "Reviewed in the United States on November 2, 2024",
    "verified_purchase": "Yes",
    "helpful_votes": "9 people found this helpful",
    "title_cleaned": "reliable, comfortable, and great value for a wired mouse!",
    "text_cleaned": "this amazon basics 3-button wired usb mouse has been a fantastic addition to my setup. it’s straightforward, plug-and-play, and works perfectly on both my laptop and desktop without needing any software installation. the tracking is surprisingly responsive, and i find the scroll wheel smooth and easy to control, which is great for browsing and document work.\n\nthe size and shape of the mouse fit comfortably in my hand, even during extended use, and i appreciate the simple, no-frills design. the usb connection is reliable, so i never experience delays or dropped connections, which can be an issue with wireless mice. for a basic mouse, this amazon basics option really exceeded my expectations and is unbeatable for the price. if you’re looking for a solid, no-nonsense wired mouse, i’d definitely recommend this one!",
    "date_cleaned": "2024-11-02",
    "verified_purchase_bool": true,
    "helpful_votes_count": 9,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8660420775413513
  },
  {
    "title": "Really budget",
    "rating": "rating",
    "text": "Its actually not that great, I wished I would have bought something with better quality for the same price. The buttons are not clicky and hard to know if you're pressing down. Big meh.",
    "reviewer_name": "stevendavid2000",
    "date": "Reviewed in the United States on May 8, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "really budget",
    "text_cleaned": "its actually not that great, i wished i would have bought something with better quality for the same price. the buttons are not clicky and hard to know if you're pressing down. big meh.",
    "date_cleaned": "2025-05-08",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 2,
    "sentiment_score": 0.48938482999801636
  },
  {
    "title": "Excellent mouse!",
    "rating": "rating",
    "text": "LOVE this mouse! it's quiet & just comfortable to use. Would def buy again!",
    "reviewer_name": "Rhonda W.",
    "date": "Reviewed in the United States on March 23, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "excellent mouse!",
    "text_cleaned": "love this mouse! it's quiet & just comfortable to use. would def buy again!",
    "date_cleaned": "2025-03-23",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 5,
    "sentiment_score": 0.8961373567581177
  },
  {
    "title": "They didn't like when they said 'basic'",
    "rating": "rating",
    "text": "Cheap mouse, cheap quality",
    "reviewer_name": "Leury",
    "date": "Reviewed in the United States on May 10, 2025",
    "verified_purchase": "Yes",
    "helpful_votes": "0",
    "title_cleaned": "they didn't like when they said 'basic'",
    "text_cleaned": "cheap mouse, cheap quality",
    "date_cleaned": "2025-05-10",
    "verified_purchase_bool": true,
    "helpful_votes_count": 0,
    "rating_processed": "rating",
    "sentiment_stars": 2,
    "sentiment_score": 0.45973333716392517
  }
]